<a href="https://colab.research.google.com/github/ialimustufa/MLFT/blob/master/Pandas_Python.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **What is Python Pandas?**

Pandas is a python library which is used for data manipulation, analysis and cleaning. 

Python pandas is well suited for different kinds of data, such as: 

* Tabular data with heterogeneously-typed columns
* Ordered and unordered time series data
* Arbitrary matrix data with row & column labels
* Unlabelled data
* Any other form of observational or statistical data sets

## Basic Concepts

The following line imports the *pandas* API and prints the API version:

In [ ]:
import pandas as pd
pd.__version__

'1.0.4'

The primary data structures in *pandas* are implemented as two classes:

  * **`DataFrame`**, which you can imagine as a relational data table, with rows and named columns.
  * **`Series`**, which is a single column. A `DataFrame` contains one or more `Series` and a name for each `Series`.

The data frame is a commonly used abstraction for data manipulation. Similar implementations exist in [Spark](https://spark.apache.org/) and [R](https://www.r-project.org/about.html).

One way to create a `Series` is to construct a `Series` object. For example:

In [ ]:
import pandas as pd
cities=pd.Series(['Delhi', 'Kolkata', 'Pune','Mumbai'])
cities

0      Delhi
1    Kolkata
2       Pune
3     Mumbai
dtype: object

`DataFrame` objects can be created by passing a `dict` mapping `string` column names to their respective `Series`. If the `Series` don't match in length, missing values are filled with special [NA/NaN](http://pandas.pydata.org/pandas-docs/stable/missing_data.html) values. Example:

In [ ]:
import pandas as pd
city_names = pd.Series(['Mumbai', 'Delhi','Banglore'])
population = pd.Series([852469, 1015785, 485199])

cities=pd.DataFrame({ 'City name': city_names, 'Population': population })
cities

  City name  Population
0    Mumbai      852469
1     Delhi     1015785
2  Banglore      485199

## Accessing Data

You can access `DataFrame` data using familiar Python dict/list operations:

In [ ]:
temp=pd.DataFrame({ 'City name': city_names, 'Population': population })
temp["City name"]

0      Mumbai
1       Delhi
2    Banglore
Name: City name, dtype: object

In [ ]:
cities['City name'][1]

'Delhi'

## Manipulating Data

You may apply Python's basic arithmetic operations to `Series`. For example:

In [ ]:
import pandas as pd
city_names = pd.Series(['Mumbai', 'Pune','kolkata','Delhi'])
population = pd.Series([852469, 1015785, 485199,20000])

cities=pd.DataFrame({ 'City name': city_names, 'Population': population })

print (cities)
print ("\n")

cities['Air_Pollution']=pd.Series([20,50,29])
cities['Area']=pd.Series([1000,500,600])
cities["Area Multiplier"]=cities['Area']*3
cities

  City name  Population
0    Mumbai      852469
1      Pune     1015785
2   kolkata      485199
3     Delhi       20000

  City name  Population  Air_Pollution    Area  Area Multiplier
0    Mumbai      852469           20.0  1000.0           3000.0
1      Pune     1015785           50.0   500.0           1500.0
2   kolkata      485199           29.0   600.0           1800.0
3     Delhi       20000            NaN     NaN              NaN

In [ ]:
cities['Area square miles'] = pd.Series([46.87, 176.53, 97.92])
cities['Air Polution']=pd.Series([10,20,30,23])
cities['Population density'] = cities['Population'] / cities['Area square miles']
cities

  City name  Population  ...  Air Polution  Population density
0    Mumbai      852469  ...            10        18187.945381
1      Pune     1015785  ...            20         5754.177760
2   kolkata      485199  ...            30         4955.055147
3     Delhi       20000  ...            23                 NaN

[4 rows x 8 columns]

[NumPy](http://www.numpy.org/) is a popular toolkit for scientific computing. *pandas* `Series` can be used as arguments to most NumPy functions:

In [ ]:
import numpy as np

np.log(population)

0    13.655892
1    13.831172
2    13.092314
3     9.903488
dtype: float64

For more complex single-column transformations, you can use `Series.apply`. Like the Python [map function](https://docs.python.org/2/library/functions.html#map), 
`Series.apply` accepts as an argument a [lambda function](https://docs.python.org/2/tutorial/controlflow.html#lambda-expressions), which is applied to each value.

The example below creates a new `Series` that indicates whether `population` is over one million:


Modifying `DataFrames` is also straightforward. For example, the following code adds two `Series` to an existing `DataFrame`:

In [ ]:
result=population.apply(lambda val: val > 1000000)
result

0    False
1     True
2    False
3    False
dtype: bool

# **Python Pandas Operations**

Using Python pandas, you can perform a lot of operations with series, data frames, missing data, group by etc.

**Slicing the Data Frame**

In order to perform slicing on data, you need a data frame.

Data frame is a 2-dimensional data structure and a most common pandas object. Dictionary will be converted into a pandas Data Frame along with index to the left.

In [ ]:
import pandas as pd
 
XYZ_web= {'Day':[1,2,3,4,5,6], "Visitors":[1000, 700,6000,1000,400,350], "Bounce_Rate":[20,20, 23,15,10,34]}
 
df= pd.DataFrame(XYZ_web)
 
print(df)

   Day  Visitors  Bounce_Rate
0    1      1000           20
1    2       700           20
2    3      6000           23
3    4      1000           15
4    5       400           10
5    6       350           34

In [ ]:
print(df.head(2))
print (df.tail(3))

   Day  Visitors  Bounce_Rate
0    1      1000           20
1    2       700           20
   Day  Visitors  Bounce_Rate
3    4      1000           15
4    5       400           10
5    6       350           34

**Merging & Joining**

In merging, you can merge two data frames to form a single data frame. You can also decide which columns you want to make common.

In [ ]:
import pandas as pd
 
df1= pd.DataFrame({ "HP":[80,90,70,60],"Rate":[2,1,2,3],"GDP":[50,45,45,67]})
 
df2= pd.DataFrame({ "HP":[80,90,70,60],"Rate":[2,1,2,3],"GDP":[50,45,45,67]})
 
merged= pd.merge(df1,df2)
 
print(merged) #before merging according to attribute

merged= pd.merge(df1,df2, on="HP")

print (merged) #after merging according to attribute

   HP  Rate  GDP
0  80     2   50
1  90     1   45
2  70     2   45
3  60     3   67
   HP  Rate_x  GDP_x  Rate_y  GDP_y
0  80       2     50       2     50
1  90       1     45       1     45
2  70       2     45       2     45
3  60       3     67       3     67

joining is yet another convenient method to combine two differently indexed dataframes into a single result dataframe. 

This is quite similar to the “merge” operation, except the joining operation will be on the “index” instead of  the “columns”.

In [ ]:
df1 = pd.DataFrame({"Rate":[2,1,2,3], "GDP":[50,45,45,67]}, index=[2001, 2002,2003,2004])
 
df2 = pd.DataFrame({"Low_HP":[50,45,67,34],"Unemployment":[1,3,5,6]}, index=[2001, 2003,2004,2004])


joined= df1.join(df2)
print(joined)
print("\n")
joined2= df2.join(df1)
print(joined2)

      Rate  GDP  Low_HP  Unemployment
2001     2   50    50.0           1.0
2002     1   45     NaN           NaN
2003     2   45    45.0           3.0
2004     3   67    67.0           5.0
2004     3   67    34.0           6.0


      Low_HP  Unemployment  Rate  GDP
2001      50             1     2   50
2003      45             3     2   45
2004      67             5     3   67
2004      34             6     3   67

**Concatenation**

Concatenation basically glues the dataframes together. You can select the dimension on which you want to concatenate.

In [ ]:
df1 = pd.DataFrame({"HPI":[80,90,70,60],"Int_Rate":[2,1,2,3], "IND_GDP":[50,45,45,67]}, index=[2001, 2002,2003,2004])
 
df2 = pd.DataFrame({"HPI":[80,90,70,60],"Int_Rate":[2,1,2,3],"IND_GDP":[50,45,45,67]}, index=[2005, 2006,2007,2008])

concat= pd.concat([df1,df2])

 
print(concat)

      HPI  Int_Rate  IND_GDP
2001   80         2       50
2002   90         1       45
2003   70         2       45
2004   60         3       67
2005   80         2       50
2006   90         1       45
2007   70         2       45
2008   60         3       67

In [ ]:
#you can define axis in concat function

df1 = pd.DataFrame({"HPI":[80,90,70,60],"Int_Rate":[2,1,2,3], "IND_GDP":[50,45,45,67]}, index=[2001, 2002,2003,2004])
 
df2 = pd.DataFrame({"HPI":[80,90,70,60],"Int_Rate":[2,1,2,3],"IND_GDP":[50,45,45,67]}, index=[2005, 2006,2007,2008])
 
concat= pd.concat([df1,df2],axis=1)
 
print(concat)

       HPI  Int_Rate  IND_GDP   HPI  Int_Rate  IND_GDP
2001  80.0       2.0     50.0   NaN       NaN      NaN
2002  90.0       1.0     45.0   NaN       NaN      NaN
2003  70.0       2.0     45.0   NaN       NaN      NaN
2004  60.0       3.0     67.0   NaN       NaN      NaN
2005   NaN       NaN      NaN  80.0       2.0     50.0
2006   NaN       NaN      NaN  90.0       1.0     45.0
2007   NaN       NaN      NaN  70.0       2.0     45.0
2008   NaN       NaN      NaN  60.0       3.0     67.0

**Change the index**

Changing the index values in a dataframe.

In [ ]:
import pandas as pd
 
df= pd.DataFrame({"Day":[1,2,3,4], "Visitors":[200, 100,230,300], "Bounce_Rate":[20,45,60,10]}) 

print (df)
 
df.set_index("Day", inplace= True)
 
print(df)

   Day  Visitors  Bounce_Rate
0    1       200           20
1    2       100           45
2    3       230           60
3    4       300           10
     Visitors  Bounce_Rate
Day
1         200           20
2         100           45
3         230           60
4         300           10

**Change the Column Headers**

Changing the headers of column in this python pandas

In [ ]:
import pandas as pd
 
df = pd.DataFrame({"Day":[1,2,3,4], "Visitors":[200, 100,230,300], "Bounce_Rate":[20,45,60,10]})

print (df)
 
df = df.rename(columns={"Visitors":"Users"})
 
print(df)

   Day  Visitors  Bounce_Rate
0    1       200           20
1    2       100           45
2    3       230           60
3    4       300           10
   Day  Users  Bounce_Rate
0    1    200           20
1    2    100           45
2    3    230           60
3    4    300           10

# Loading Data from CSV
But most of the time, you load an entire file into a `DataFrame`. The following example loads a file with California housing data. Run the following cell to load the data and create feature definitions:

In [ ]:
california_housing_dataframe = pd.read_csv("https://storage.googleapis.com/mledu-datasets/california_housing_train.csv", sep=",")
print(california_housing_dataframe)
print("\n")
california_housing_dataframe.describe()

       longitude  latitude  ...  median_income  median_house_value
0        -114.31     34.19  ...         1.4936             66900.0
1        -114.47     34.40  ...         1.8200             80100.0
2        -114.56     33.69  ...         1.6509             85700.0
3        -114.57     33.64  ...         3.1917             73400.0
4        -114.57     33.57  ...         1.9250             65500.0
...          ...       ...  ...            ...                 ...
16995    -124.26     40.58  ...         2.3571            111400.0
16996    -124.27     40.69  ...         2.5179             79000.0
16997    -124.30     41.84  ...         3.0313            103600.0
16998    -124.30     41.80  ...         1.9797             85800.0
16999    -124.35     40.54  ...         3.0147             94600.0

[17000 rows x 9 columns]

          longitude      latitude  ...  median_income  median_house_value
count  17000.000000  17000.000000  ...   17000.000000        17000.000000
mean    -119.562108     35.625225  ...       3.883578       207300.912353
std        2.005166      2.137340  ...       1.908157       115983.764387
min     -124.350000     32.540000  ...       0.499900        14999.000000
25%     -121.790000     33.930000  ...       2.566375       119400.000000
50%     -118.490000     34.250000  ...       3.544600       180400.000000
75%     -118.000000     37.720000  ...       4.767000       265000.000000
max     -114.310000     41.950000  ...      15.000100       500001.000000

[8 rows x 9 columns]

The example above used `DataFrame.describe` to show interesting statistics about a `DataFrame`. Another useful function is `DataFrame.head`, which displays the first few records of a `DataFrame`:

In [ ]:
california_housing_dataframe.dropna(axis=1)

       longitude  latitude  ...  median_income  median_house_value
0        -114.31     34.19  ...         1.4936             66900.0
1        -114.47     34.40  ...         1.8200             80100.0
2        -114.56     33.69  ...         1.6509             85700.0
3        -114.57     33.64  ...         3.1917             73400.0
4        -114.57     33.57  ...         1.9250             65500.0
...          ...       ...  ...            ...                 ...
16995    -124.26     40.58  ...         2.3571            111400.0
16996    -124.27     40.69  ...         2.5179             79000.0
16997    -124.30     41.84  ...         3.0313            103600.0
16998    -124.30     41.80  ...         1.9797             85800.0
16999    -124.35     40.54  ...         3.0147             94600.0

[17000 rows x 9 columns]

In [ ]:
california_housing_dataframe.tail(10)

       longitude  latitude  ...  median_income  median_house_value
16990    -124.22     41.73  ...         1.7038             78300.0
16991    -124.23     41.75  ...         2.4805             73200.0
16992    -124.23     40.81  ...         3.3462             50800.0
16993    -124.23     40.54  ...         3.0806            106700.0
16994    -124.25     40.28  ...         1.9417             76100.0
16995    -124.26     40.58  ...         2.3571            111400.0
16996    -124.27     40.69  ...         2.5179             79000.0
16997    -124.30     41.84  ...         3.0313            103600.0
16998    -124.30     41.80  ...         1.9797             85800.0
16999    -124.35     40.54  ...         3.0147             94600.0

[10 rows x 9 columns]

## Indexes
Both `Series` and `DataFrame` objects also define an `index` property that assigns an identifier value to each `Series` item or `DataFrame` row. 

By default, at construction, *pandas* assigns index values that reflect the ordering of the source data. Once created, the index values are stable; that is, they do not change when data is reordered.

In [ ]:
import pandas as pd
import numpy as np
city_names = pd.Series(['Mumbai', 'Pune','kolkata','Delhi'])
population = pd.Series([852469, 1015785, 485199,20000])

cities=pd.DataFrame({ 'City name': city_names, 'Population': population })

print (cities)

  City name  Population
0    Mumbai      852469
1      Pune     1015785
2   kolkata      485199
3     Delhi       20000

In [ ]:
city_names.index

RangeIndex(start=0, stop=4, step=1)

In [ ]:
population.index

RangeIndex(start=0, stop=4, step=1)

Call `DataFrame.reindex` to manually reorder the rows. For example, the following has the same effect as sorting by city name:

In [ ]:
cities.reindex([0, 2, 1])

  City name  Population
0    Mumbai      852469
2   kolkata      485199
1      Pune     1015785

Reindexing is a great way to shuffle (randomize) a `DataFrame`. In the example below, we take the index, which is array-like, and pass it to NumPy's `random.permutation` function, which shuffles its values in place. Calling `reindex` with this shuffled array causes the `DataFrame` rows to be shuffled in the same way.
Try running the following cell multiple times!

In [ ]:
cities.reindex(np.random.permutation(cities.index))

  City name  Population
3     Delhi       20000
2   kolkata      485199
1      Pune     1015785
0    Mumbai      852469

#**TASK 4**

Create the `cities` table having city names
'San Francisco', 'San Jose', 'Sacramento', 'Jordan'

by adding a new boolean column that is True if and only if *both* of the following are True:

  * The city name startswith San. 
  Hint (use function startswith ())
  * The city has an area greater than 50 square miles.

**Note:** Boolean `Series` are combined using the bitwise, rather than the traditional boolean, operators. For example, when performing *logical and*, use `&` instead of `and`.